Tekla.Structures.Geometry3d.MatrixFactory.Rotate(System.Double,Tekla.Structures.Geometry3d.Vector)
Returns a rotation matrix in a Clockwise rotation around the given rotation axis,
defined by the given angle and the given rotation axis.
Angle: The rotation angle (in radians).
Axis: The rotation axis.
Returns: The new rotation matrix.
This example rotates a beam StartPoint 45 degrees.
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
public class Example
{
private void RotatePickedBeamStartPoint()
{
Model myModel = new Model();
Picker myPicker = new Picker();
Beam myBeam = (Beam)myPicker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick Beam");
CoordinateSystem beamCoordSys = myBeam.GetCoordinateSystem();
Point origin = myBeam.EndPoint;
Point XPoint = new Point(beamCoordSys.AxisX.X, beamCoordSys.AxisX.Y, beamCoordSys.AxisX.Z);
Vector Zvector = beamCoordSys.AxisY.Cross(beamCoordSys.AxisX);
TransformationPlane plane = new TransformationPlane((new CoordinateSystem(origin, beamCoordSys.AxisX, Zvector)));
myModel.GetWorkPlaneHandler().SetCurrentTransformationPlane(plane);
myBeam.Select();
Vector ZVector = new Vector(0, 0, 1);
double rotationRadian = 0.785398; // 45°
Matrix matrix = MatrixFactory.Rotate(rotationRadian, ZVector);
myBeam.StartPoint = matrix.Transform(myBeam.StartPoint);
myBeam.Modify();
myModel.CommitChanges();
}
}